hiepnguyen57/stm32f7_micarray/Apps/src/main.c
	2-------  Buffer3                         Buffer1                         Buffer2		  
			  
	3-------  Buffer2                         Buffer3                         Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
			/* Processing Data */
			switch (buffer_switch)  //buffer_switch
			{             
				case BUF1_PLAY:                    
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer3);

					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					//   {
					//      ////Error_Handler();
					//   }
					
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer3,stDirBeam,(int16_t *)bufBeam1);

						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer3.bufMIC1[i] = bufBeam1[i];
						}
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer3,stDirBeam,OutData);

						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer3.bufMIC1[i] = bufBeam1[i];
							 Buffer3.bufMIC2[i] = bufBeam2[i];
						}
					}               
					break;
				case BUF2_PLAY:
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer1);
					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					// {
					//     ////Error_Handler();
					// }
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer1,stDirBeam,(int16_t *)bufBeam1);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer1.bufMIC1[i] = bufBeam1[i];
						}
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer1,stDirBeam,OutData);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer1.bufMIC1[i] = bufBeam1[i];
							 Buffer1.bufMIC2[i] = bufBeam2[i];
						}
					 }
				break;
							
			   case BUF3_PLAY:
				
					/* Sound Source Localization */
					Direction = DOACalc(&Buffer2);
					// if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, Direction*60-1) != HAL_OK)
					// {
					//      ////Error_Handler();
					// }
					if (stOption==0)
					{
						/* Summing in Buffer3 */
						BeamFormingSD(&Buffer2,stDirBeam,(int16_t *)bufBeam1);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer2.bufMIC1[i] = bufBeam1[i];
						}                        
					}
					else
					{
						OutData.bufMIC1 = bufBeam1;
						OutData.bufMIC2 = bufBeam2;
						/* Beam on forward and backward of sound source */
						BeamFormingSDCom(&Buffer2,stDirBeam,OutData);
						for (uint16_t i=0; i< PAR_N; i++)
						{
							 Buffer2.bufMIC1[i] = bufBeam1[i];
							 Buffer2.bufMIC2[i] = bufBeam2[i];
						}
					 }

				break;
							
				default:
					break;
			   
		}
			
		AudioPlayerUpd();
	  }

}


inline static void Audio_Play_Out(void)
{

/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                          Buffer3
			  
	2-------  Buffer3                         Buffer1                           Buffer2		  
			  
	3-------  Buffer2                         Buffer3                           Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
	flgRacing=0;

#if USB_STREAMING
	AudioUSBSend(idxFrmUSB);
#endif

	++idxFrmUSB;
	/* if player is finished for curent buffer                                  */ 
	if (idxFrmUSB == PAR_N/(AUDIO_SAMPLING_FREQUENCY/1000))
	{

	   RESET_IDX
	   idxFrmUSB=0;
	  switch (buffer_switch)
	  {
		  case BUF1_PLAY:
			  /* set flag for switch buffer */		  
			  buffer_switch = BUF3_PLAY;
			  break;
		   case BUF2_PLAY:
			  /* set flag for switch buffer */
			  buffer_switch = BUF1_PLAY;        
			  break;
		   case BUF3_PLAY:
			  /* set flag for switch buffer */		  
			  buffer_switch = BUF2_PLAY;
			  break;
		   default:
			  break;
	  }
	}
}

void LedRing_Event(uint8_t Command)
{
	switch(Command)
	{
		case CLEAN_ALL:
			CLEAR_ALL_LEDS();
			break;

		case LED_DIMMING:
			stripEffect_HeartBeat(700, 64, 0, 16);
			break;

		case LED_CIRCLE:
			stripEffect_CircularRing(50, 0, 0, 20);
			break;

		case LED_PATTERN:
			stripEffect_PatternMove(50, 2, 10, 10, 10);
			break;

		case COLOR_WHEEL:
			stripEffect_ColorWheel(50);
			break;

		case LED_ALLCOLORS:
			stripEffect_AllColors(10);
			break;

		case LED_EMPTY:
			stripEffect_FullEmpty(80, 100, 100, 100);
			break;
	}
}

void Button_Event(uint8_t Command)
{
	uint8_t led_num;
	uint8_t i;
	led_num = ((aRxBuffer[2] - 20) / 10) * 2;
	printf("led num: %d\r\n", led_num);
	switch(Command)
	{
		case VOLUME_UP:
			// for(i = 0; i < led_num; i++)
			// {
			// 	setLEDcolor(i, 100, 100, 100);
			// }
			// HAL_Delay(1000);
			// CLEAR_ALL_LEDS();
			// isVolumeBtInProcess = RESET;
			// break;

		case VOLUME_DOWN:
			for(i = 0; i < led_num; i++)
			{
				setLEDcolor(i, 100, 100, 100);
			}
			HAL_Delay(1000);
			CLEAR_ALL_LEDS();
			isVolumeBtInProcess = RESET;
			break;

		case VOLUME_MUTE:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(100, 100, 0);
			HAL_Delay(2000);
			CLEAR_ALL_LEDS();
			isVolumeBtInProcess = RESET;//for case volume below 20%
			break;

		case VOLUME_UNMUTE:
			CLEAR_ALL_LEDS();
			for(i = 0; i < led_num; i++)
			{
				setLEDcolor(i, 100, 100, 100);
			}
			HAL_Delay(2000);
			CLEAR_ALL_LEDS();
			break;

		// case MICROPHONE_MUTE:
		// 	CLEAR_ALL_LEDS();
		// 	setWHOLEcolor(100, 0, 0);
		// 	MIC_CHECK = 1;
		// 	break;

		// case MICROPHONE_UNMUTE:
		// 	CLEAR_ALL_LEDS();
		// 	MIC_CHECK = 0;
		// 	break;
	}
}

void User_Event(uint8_t Command)
{
	switch(Command)
	{
		case WAKE_WORD_STOP:
			stripEffect_AlternateColors(1000, 10, 50, 0, 0, 0, 0, 50);
			CLEAR_ALL_LEDS();
			break;

		case WIFI_DISCONNECTED:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(208, 119, 11);
			break;

		case WIFI_CONNECTED:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(0, 178, 11);
			HAL_Delay(2000);
			CLEAR_ALL_LEDS();
			break;

		case MICROPHONE_MUTE:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(100, 0, 0);
			MIC_CHECK = 1;
			break;

		case MICROPHONE_UNMUTE:
			CLEAR_ALL_LEDS();
			MIC_CHECK = 0;
			break;

		// case RECORD_ERROR:
		// 	CLEAR_ALL_LEDS();
		// 	setWHOLEcolor(10, 0, 0);
		// 	HAL_Delay(3000);
		// 	CLEAR_ALL_LEDS();
		// 	break;

		case BLE_ON:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(0, 10, 0);
			HAL_Delay(2000);
			CLEAR_ALL_LEDS();
			break;

