hiepnguyen57/stm32f7_micarray/Apps/src/main.c
		case BLE_OFF:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(10, 5, 0);
			HAL_Delay(2000);
			CLEAR_ALL_LEDS();
			break;

		case USB_AUDIO:
			CLEAR_ALL_LEDS();
			/* 2 channels:16Khz Audio USB */
			USB_Audio_Config();
			LEDx_OnOff(CY8C_LED1_PIN, GPIO_PIN_SET);
			LEDx_OnOff(CY8C_LED2_PIN, GPIO_PIN_SET);
			LEDx_OnOff(CY8C_LED3_PIN, GPIO_PIN_SET);
			LEDx_OnOff(CY8C_LED4_PIN, GPIO_PIN_SET);
			HAL_Delay(1500);
			LEDx_OnOff(CY8C_LED1_PIN, GPIO_PIN_RESET);
			LEDx_OnOff(CY8C_LED2_PIN, GPIO_PIN_RESET);
			LEDx_OnOff(CY8C_LED3_PIN, GPIO_PIN_RESET);
			LEDx_OnOff(CY8C_LED4_PIN, GPIO_PIN_RESET);
			break;

		case CLIENT_ERROR:
			CLEAR_ALL_LEDS();
			setWHOLEcolor(223, 0, 41);
			break;
	}
}

void Control_Handler(void)
{
	switch(aRxBuffer[0])
	{
		case LED_RING:
			LedRing_Event(aRxBuffer[1]);
			break;
		case MIC_ARRAY:
			break;
		case CYPRESS_BUTTON:
			Button_Event(aRxBuffer[1]);
			break;
		case USER_EVENT:
			User_Event(aRxBuffer[1]);
			break;
		// case LED_RGB:
		// 	setWHOLEcolor(aRxBuffer[1], aRxBuffer[2], aRxBuffer[3]);
		// 	break;
		default:
			logs("Nothing");
			break;
	}
}
/**
	* @brief  Main program
	* @param  None
	* @retval None
	*/
int main(void)
{
	/* Enable the CPU Cache */
	CPU_CACHE_Enable();
	HAL_Init();

	/* Configure the system clock to 216 MHz */
	SystemClock_Config();
	log_init();

	BSP_AUDIO_OUT_ClockConfig(AUDIO_FREQ, NULL);

	/* Pin configuration for audio */
	Codec_GPIO_Init();

	/* Configure GPIO */
	MBR3_HOST_INT_Config();
	MX_GPIO_Init();

	//Configure I2C bus
	I2C1_Init();
	I2C4_Init();

	STA321MP_Ini();

	/* Configure MBR3 */
	result = ConfigureMBR3();
	if(result != CY8CMBR3116_Result_OK)
	{
		logs_error("Configure MBR3");
	}

	/* Configure LED RING */
	ws281x_init();
	setWHOLEcolor(100, 100, 100);

	/* PWM output */
	//PWMInit();

	/* Init Superdirective Beamforming */
	BeamFormingSD_Init();

	/* 2 channels:16Khz Audio USB */
	//USB_Audio_Config();

	__disable_irq();
	MIC1TO6_Init();
	StartRecord();
	__enable_irq();

	while(1)
	{
		if(BT_EVENTSTATE == 0)
		{
			if(!MIC_CHECK)
			{
				BF_Update();
				if (flg10ms==1)
				{
					flg10ms=0;  
#if DEBUG
					sprintf((char *)(pUARTBuf),"Direction: %3d\r\n",Direction*60);
					printf("%s\r\n", pUARTBuf);
#endif
				}
			}

		}
		else {
			//backup buffer
			Ex_Buffer[0] = aRxBuffer[0];
			Ex_Buffer[1] = aRxBuffer[1];
			Control_Handler();
			if((Ex_Buffer[0] == aRxBuffer[0]) && Ex_Buffer[1] == aRxBuffer[1])
			{
				BT_EVENTSTATE = 0;
			}
		}
	}
}


/**
	* @brief  System Clock Configuration
	*         The system Clock is configured as follow : 
	*            System Clock source            = PLL (HSE)
	*            SYSCLK(Hz)                     = 216000000
	*            HCLK(Hz)                       = 216000000
	*            AHB Prescaler                  = 1
	*            APB1 Prescaler                 = 4
	*            APB2 Prescaler                 = 2
	*            HSE Frequency(Hz)              = 25000000
	*            PLL_M                          = 25
	*            PLL_N                          = 432
	*            PLL_P                          = 2
	*            PLL_Q                          = 9
	*            VDD(V)                         = 3.3
	*            Main regulator output voltage  = Scale1 mode
	*            Flash Latency(WS)              = 7
	* @param  None
	* @retval None
	*/

void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	HAL_StatusTypeDef ret = HAL_OK;

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 25;
	RCC_OscInitStruct.PLL.PLLN = 432;  // 432
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 9;

	ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* Activate the OverDrive to reach the 216 MHz Frequency */
	ret = HAL_PWREx_EnableOverDrive();
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* Select PLLSAI output as USB clock source */
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48 ;
	PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;

  
	PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
	PeriphClkInitStruct.PLLSAI.PLLSAIQ = 4; 
	PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV4;
	PeriphClkInitStruct.PLLSAI.PLLSAIR = 2;


	ret = HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct); 
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}
  
	/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

	ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7);
	if(ret != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}
  
	//sop1hc 344/7 = 49.142 MHz
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2|RCC_PERIPHCLK_I2S;
	PeriphClkInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
	PeriphClkInitStruct.I2sClockSelection = RCC_I2SCLKSOURCE_PLLI2S;
	PeriphClkInitStruct.PLLI2S.PLLI2SP = 8;
	PeriphClkInitStruct.PLLI2S.PLLI2SN = 344;//244
	PeriphClkInitStruct.PLLI2S.PLLI2SQ = 7;
	PeriphClkInitStruct.PLLI2S.PLLI2SR = 7;
	PeriphClkInitStruct.PLLI2SDivQ = 1;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);  
}

void BSP_AUDIO_OUT_ClockConfig(uint32_t AudioFreq, void *Params)
{
	RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStruct;

	HAL_RCCEx_GetPeriphCLKConfig(&RCC_ExCLKInitStruct);

	/* Set the PLL configuration according to the audio frequency */
	if((AudioFreq == AUDIO_FREQUENCY_11K) || (AudioFreq == AUDIO_FREQUENCY_22K) || (AudioFreq == AUDIO_FREQUENCY_44K))
	{
		/* Configure PLLSAI prescalers */
		/* PLLI2S_VCO: VCO_429M
		SAI_CLK(first level) = PLLI2S_VCO/PLLSAIQ = 429/2 = 214.5 Mhz
		SAI_CLK_x = SAI_CLK(first level)/PLLI2SDivQ = 214.5/19 = 11.289 Mhz */
		RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
		RCC_ExCLKInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
		RCC_ExCLKInitStruct.PLLI2S.PLLI2SP = 8;
		RCC_ExCLKInitStruct.PLLI2S.PLLI2SN = 429;
		RCC_ExCLKInitStruct.PLLI2S.PLLI2SQ = 2;
		RCC_ExCLKInitStruct.PLLI2SDivQ = 19;
		HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct);
	}
	else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_48K), AUDIO_FREQUENCY_96K */
	{
		/* SAI clock config
		PLLI2S_VCO: VCO_344M
		SAI_CLK(first level) = PLLI2S_VCO/PLLSAIQ = 344/7 = 49.142 Mhz
		SAI_CLK_x = SAI_CLK(first level)/PLLI2SDivQ = 49.142/1 = 49.142 Mhz */
		RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
		RCC_ExCLKInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
		//RCC_ExCLKInitStruct.I2sClockSelection = RCC_I2SCLKSOURCE_PLLI2S;
		//RCC_ExCLKInitStruct.PLLI2S.PLLI2SP = 8;
		RCC_ExCLKInitStruct.PLLI2S.PLLI2SN = 344;//244
		RCC_ExCLKInitStruct.PLLI2S.PLLI2SQ = 7;
		//RCC_ExCLKInitStruct.PLLI2S.PLLI2SR = 1;
		RCC_ExCLKInitStruct.PLLI2SDivQ = 1;
		HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct);
	}
}

/**
  * @brief  This function configure I2C1 bus.
  * @param  None
  * @retval None
  */
void I2C1_Init(void)
{
	/*##Configure the I2C peripheral ######################################*/
	hi2c1.Instance              = I2Cx_MASTER;
	hi2c1.Init.Timing           = I2CX_TIMING;
	hi2c1.Init.OwnAddress1      = 0;
	hi2c1.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
	hi2c1.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
	hi2c1.Init.OwnAddress2      = 0;
	hi2c1.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
	hi2c1.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;

	if(HAL_I2C_Init(&hi2c1) != HAL_OK)
	{
		/* Initialization Error */
		_Error_Handler(__FILE__, __LINE__);
	}

