hiepnguyen57/stm32f7_micarray/Apps/src/main.c
	/* Enable the Analog I2C Filter */
	HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE);
}

/**
  * @brief  This function configure I2C1 bus.
  * @param  None
  * @retval None
  */
void I2C4_Init(void)
{
	GPIO_InitTypeDef  			GPIO_InitStruct;
	RCC_PeriphCLKInitTypeDef  	RCC_PeriphCLKInitStruct;

	  /*##-1- Configure the I2C clock source. The clock is derived from the SYSCLK #*/
	RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_I2Cx_CPU;
	RCC_PeriphCLKInitStruct.I2c4ClockSelection = RCC_I2Cx_CPU_CLKSOURCE_SYSCLK;
	HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);

	/*##-2- Enable peripherals and GPIO Clocks #################################*/
	/* Enable GPIO TX/RX clock */
	I2Cx_CPU_SCL_GPIO_CLK_ENABLE();
	I2Cx_CPU_SDA_GPIO_CLK_ENABLE();

	  /* Enable I2Cx clock */
	I2Cx_CPU_CLK_ENABLE();

	/*##-3- Configure peripheral GPIO ##########################################*/
	  /** I2C1 GPIO configuration
		PD12 ------> I2C4_SCL
		PD13 ------> I2C4_SDA
	*/
	/* I2C SCL GPIO pin configuration  */
	GPIO_InitStruct.Pin       = I2Cx_CPU_SCL_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;
	GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = I2Cx_CPU_SCL_SDA_AF;
	HAL_GPIO_Init(I2Cx_CPU_SCL_GPIO_PORT, &GPIO_InitStruct);
	  
	/* I2C SDA GPIO pin configuration  */
	GPIO_InitStruct.Pin       = I2Cx_CPU_SDA_PIN;
	GPIO_InitStruct.Alternate = I2Cx_CPU_SCL_SDA_AF;
	HAL_GPIO_Init(I2Cx_CPU_SDA_GPIO_PORT, &GPIO_InitStruct);
	
	  /* NVIC for I2Cx */
	HAL_NVIC_SetPriority(I2Cx_CPU_ER_IRQn, 0, 1);
	HAL_NVIC_EnableIRQ(I2Cx_CPU_ER_IRQn);
	HAL_NVIC_SetPriority(I2Cx_CPU_EV_IRQn, 0, 2);
	HAL_NVIC_EnableIRQ(I2Cx_CPU_EV_IRQn);

	/*##Configure the I2C peripheral ######################################*/
	hi2c4.Instance              = I2Cx_CPU;
	hi2c4.Init.Timing           = I2CX_TIMING;
	hi2c4.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
	hi2c4.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
	hi2c4.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
	hi2c4.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
	hi2c4.Init.OwnAddress1      = I2C_ADDRESS;

	if(HAL_I2C_Init(&hi2c4) != HAL_OK)
	{
		/* Initialization Error */
		_Error_Handler(__FILE__, __LINE__);
	}
	/* Enable the Analog I2C Filter */
	HAL_I2CEx_ConfigAnalogFilter(&hi2c4, I2C_ANALOGFILTER_ENABLE);
}

void MX_GPIO_Init(void)
{
	GPIO_InitTypeDef    GPIO_Init;

	CPU_INPUT_GPIO_CLK_ENABLE();
	CPU_OUTPUT_GPIO_CLK_ENABLE();
	CY8C_RESET_GPIO_CLK_ENABLE();
	CY8C_LED_GPIO_CLK_ENABLE();

	 // Configure PD3 as output pin
	GPIO_Init.Pin   = CPU_OUTPUT_PIN;
	GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
	GPIO_Init.Pull  = GPIO_PULLUP;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(CPU_OUTPUT_GPIO_PORT, &GPIO_Init);

	/* Configure PD2 pin as input floating */
	GPIO_Init.Mode = GPIO_MODE_IT_FALLING;
	GPIO_Init.Pull = GPIO_NOPULL;
	GPIO_Init.Pin  = CPU_INPUT_PIN;
	HAL_GPIO_Init(CPU_INPUT_GPIO_PORT, &GPIO_Init);

	/* Configure PE14 as output pin */
	GPIO_Init.Pin  = PWR_LEDRING_PIN;
	GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
	GPIO_Init.Pull = GPIO_PULLUP;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(PWR_LEDRING_GPIO_PORT, &GPIO_Init);

	//LED_RING_PWR is set to 1
	HAL_GPIO_WritePin(PWR_LEDRING_GPIO_PORT, PWR_LEDRING_PIN, GPIO_PIN_SET);

	// Configure LEDs
	GPIO_Init.Pin   = CY8C_LED1_PIN | CY8C_LED2_PIN | CY8C_LED3_PIN
						| CY8C_LED4_PIN | CY8C_PROX_LED_PIN;
	GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
	GPIO_Init.Pull  = GPIO_PULLUP;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(CY8C_LED_GPIO_PORT, &GPIO_Init);

	//Enable line 2 interrupt
	HAL_NVIC_SetPriority(EXTI2_IRQn, 0, 1);
	HAL_NVIC_EnableIRQ(EXTI2_IRQn);
}

void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{

}
void SubFrameFinished(void)
{
	Audio_Play_Out();
}

void PWMInit(void)
{
	RCC_PeriphCLKInitTypeDef        RCC_PeriphCLKInitStruct;

	/* ### - 1 - Re-target the LSE to Clock the LPTIM Counter ################# */
	/* Select the LSE clock as LPTIM peripheral clock */
	RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LPTIM1;
	RCC_PeriphCLKInitStruct.Lptim1ClockSelection = RCC_LPTIM1CLKSOURCE_LSE;  
	HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);

	/* ### - 2 - Initialize the LPTIM peripheral ############################## */
	/*
	*  Instance        = LPTIM1
	*  Clock Source    = APB or LowPowerOSCillator (in this example LSI is
	*                    already selected from the RCC stage)
	*  Counter source  = External event.
	*  Clock prescaler = 1 (No division)
	*  Counter Trigger = Software trigger
	*  Output Polarity = High
	*  Update mode     = Immediate (Registers are immediately updated after any
	*                    write access) 
	*/

	LptimHandle.Instance = LPTIM1;
	LptimHandle.Init.Clock.Source    = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
	LptimHandle.Init.Clock.Prescaler = LPTIM_PRESCALER_DIV1;  
	LptimHandle.Init.CounterSource   = LPTIM_COUNTERSOURCE_INTERNAL;
	LptimHandle.Init.Trigger.Source  = LPTIM_TRIGSOURCE_SOFTWARE; 
	LptimHandle.Init.OutputPolarity  = LPTIM_OUTPUTPOLARITY_HIGH;
	LptimHandle.Init.UpdateMode      = LPTIM_UPDATE_IMMEDIATE;

	/* Initialize LPTIM peripheral according to the passed parameters */
	if (HAL_LPTIM_Init(&LptimHandle) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/* ### - 3 - Start counting in interrupt mode ############################# */
	/*
	*  Period = 99
	*  Pulse  = 49
	*  According to this configuration, the duty cycle will be equal to 50%
	*/
	if (HAL_LPTIM_PWM_Start(&LptimHandle, 359, 0) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}
}

void EXTI4_IRQHandler(void)
{
	/* EXTI line interrupt detected */
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_4) != RESET)
	{
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);
	}
}


/**
  * @brief  This function handles External line 1 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI1_IRQHandler(void)
{
    /* EXTI line 1 interrupt detected */
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_1) != RESET)
    {
        //Read button status
        result = ReadandDisplaySensorStatus();
        if(result != CY8CMBR3116_Result_OK)
        {
            logs_error("CYPRESS read status");
        }
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);
    HAL_GPIO_EXTI_Callback(GPIO_PIN_1);
}

/**
  * @brief  This function handles External line 2 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI2_IRQHandler(void)
{
    /* EXTI line 2 interrupt detected */
    if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_2) != RESET)
    {
        //receiving data from Mainboard
        //logs("Receive I2C Data from Mainboard");
        if(HAL_I2C_Slave_Receive_IT(&hi2c4, (uint8_t *)aRxBuffer, 3) == HAL_OK)
        {
            //printf("%#x\r\n", aRxBuffer[0]);
            //printf("%#x\r\n", aRxBuffer[1]);
            if(aRxBuffer[0] == LED_RING)
			{
				StopEffect = aRxBuffer[2];
			}
            //printf("%#x\r\n", aRxBuffer[2]);
        }
        BT_EVENTSTATE = 1;
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_2);
    HAL_GPIO_EXTI_Callback(GPIO_PIN_2);

